In [1]:
print("Hello World!")

Hello World!

In [2]:
# !pip install SQLAlchemy
# !pip install ipython-sql

In [3]:
# !pip install --upgrade pandas

In [4]:
import pandas as pd
import sqlite3,sqlalchemy
from typing import Optional,List
from sqlalchemy import ForeignKey,UniqueConstraint
from sqlalchemy import Integer, Float, DateTime,Boolean
from sqlalchemy import String
from sqlalchemy.orm import Mapped
from sqlalchemy.orm import mapped_column
from sqlalchemy.orm import DeclarativeBase
from sqlalchemy.orm import relationship

In [5]:
pd.__version__, sqlite3.sqlite_version,sqlalchemy.__version__

('2.0.3', '3.36.0', '2.0.29')

In [1]:
!wget https://laxman225.github.io/python-learning/nbabasketballdb.sqlite3

'wget' is not recognized as an internal or external command,
operable program or batch file.

In [6]:
%load_ext sql

In [8]:

%sql sqlite:///nbabasketballdb.sqlite3

In [10]:
# %sql select count(*) from player_career_stats
# %sql select count(*) from teams
# %sql select count(*) from players
# %sql select * from players where full_name = 'LeBron James'
# %sql select * from teams where abbreviation = 'LAL'
# %sql select * from player_career_stats where id = 2544
# %sql select * from player_career_stats where id in (select id from players where full_name = 'LeBron James')
# %sql select count(*),team,id from player_career_stats group by id ,team
# %sql select * from player_career_stats where team='LAL'
# %sql select sum(pts) totpts,count(*) totseasons,id,team,sum(pts)/count(*) avgpoints_per_season from player_career_stats group by id ,team

In [55]:
mhteam = pd.DataFrame([[999999999,'Morris Hills High School','MHI','Knights','Randolph','NJ',1989]],columns=['id', 'name', 'abbreviation', 'nickname', 'city', 'state', 'year_founded'])
mhplayers = pd.DataFrame([
        [999001,'Pranav Munigala','Pranav','Munigala',True],
        [999002,'Eeshan Bhansali','Eeshan','Bhansali',True],
        [999003,'Siddhant Bhansali','Siddhant','Bhansali',True],
        [999004,'Raj Shah','Raj','Shah',True]

    ],
    columns=['id','full_name','first_name','last_name','is_active'])

In [56]:
# mhteam.to_sql('teams', engine,if_exists='append',index=False)
# mhplayers.to_sql('players', engine,if_exists='append',index=False)

2024-03-25 11:22:07,189 INFO sqlalchemy.engine.Engine BEGIN (implicit)
2024-03-25 11:22:07,191 INFO sqlalchemy.engine.Engine PRAGMA main.table_info("players")
2024-03-25 11:22:07,193 INFO sqlalchemy.engine.Engine [raw sql] ()
2024-03-25 11:22:07,196 INFO sqlalchemy.engine.Engine INSERT INTO players (id, full_name, first_name, last_name, is_active) VALUES (?, ?, ?, ?, ?)
2024-03-25 11:22:07,196 INFO sqlalchemy.engine.Engine [generated in 0.00140s] [(999002, 'Eeshan Bhansali', 'Eeshan', 'Bhansali', 1), (999003, 'Siddhant Bhansali', 'Siddhant', 'Bhansali', 1), (999004, 'Raj Shah', 'Raj', 'Shah', 1)]
2024-03-25 11:22:07,201 INFO sqlalchemy.engine.Engine COMMIT

3

In [11]:
%sql select * from players where id >= 999001 limit 4
# %sql select * from teams where id = 999999999

 * sqlite:///nbabasketballdb.sqlite3
Done.

[(999001, 'Pranav Munigala', 'Pranav', 'Munigala', 1),
 (999002, 'Eeshan Bhansali', 'Eeshan', 'Bhansali', 1),
 (999003, 'Siddhant Bhansali', 'Siddhant', 'Bhansali', 1),
 (999004, 'Raj Shah', 'Raj', 'Shah', 1)]

In [18]:
# %sql insert into teams values (0,'TEST High School','TTT','Test','Randolph','NJ',1989)
# %sql update teams set name = 'Dream High School' where id = 0
# %sql delete from teams where id = 0
%sql select * from teams where id = 0

 * sqlite:///nbabasketballdb.sqlite3
Done.

[]